var config = {
    /*在这里配置你的基本信息，所有数据以字符串形式给出*/
    name: "木林彪",
    sex: "男",
    age: "24",
    phone: "15911245016",
    email: "arturiamumu@gmail.com",
    address: "现居北京",
    qq: "1743089727",
    log: "arturiamu",
    excpect_work: "Golang 后端开发",


    /*在这里配置首页的座右铭集合*/
    motto: [
        "1",
        "2",
        "3",
        "4",
    ],


    /*在这里配置首页的见面信息，你可以内嵌HTML标签以调整格式*/
    welcome: "你好，我叫木林彪，是一名后端程序员<br>" +
        "很高兴见到你!",


    /*在这里配置关于我的信息，你可以内嵌HTML标签以调整格式*/
    skills_description: "<ul>" +
        "     <li>熟悉 Golang 开发,熟练使用 go 标准库以及 gin,gorm 等开源库</li>" +
        "     <li>熟悉 MySQL,TiDB 等常用数据库的使用,以及 SQL 语句编写,调优</li>" +
        "     <li>操作系统、计算机网络等编程基础知识良好</li>" +
        "     <li>熟悉基本Linux命令操作</li>" +
        "     <li>熟悉缓存、消息等机制</li>" +
        "     <li>了解分布式系统的设计与应用</li>" +
        "     <li>有 Docker,Kubernetes 等云原生经验</li>" +
        "     <li>熟悉HTML、CSS、JavaScript以及相应前端知识</li>" +
        "     <li>掌握 Git 版本控制工具,能熟练进行团伙写作和代码管理</li>" +
        " </ul>",

    about: "<p>hi！我叫木林彪，性别男，毕业于昆明理工大学(2023)。我期望的工作岗位是 Golang 后端开发。</p>" +
        "<p>我有着较多的 Golang 编程经验，计算机基础知识掌握扎实，能够在工作中很好的完成自己的任务。此外，我有着充满激情的工作态度，团队协同作战能力强，同时我也具备独立开发的能力，擅于发现并解决问题。我的执行力强、责任感高、集体荣誉感强、敢于担当。</p>" +
        "<p>十分期待与您的联系!</p>",


    /*这里填写你的技能描述，你可以内嵌HTML标签以调整格式*/
    /**
     * 在这里配置你的技能点
     * ["技能点", 掌握程度, "技能条颜色"]
     */
    skills: [
        ["GoLang", 90, "#ff001d"],
        ["数据库", 88, "#ff424b"],
        ["操作系统", 85, "#ff992e"],
        ["计算机网络", 85, "#ecc24a"],
        ["前端技能", 83, "#fefd41"],
    ],


    /**
     * 这里填写你的个人作品展示
     * ["img"，"url", "ProjectName", "brief"]
     * img表示您的作品图片链接，url表示您的项目地址，ProjectName表示您的仓库或作品名称，brief是一句简短的介绍
     * 通过查看实际效果以调整字题长度
     */
    portfolio: [
        ["./images/pro-1.png", "https://blog.mulinbiao.com", "个人博客", "这里记录了我的工作,学习和生活<br>持续更新"],
        ["./images/pro-2.png", "https://github.com/happysnaker/Gobang", "智能人机对战五子棋", "采用C++编写的智能五子棋人机对战<br>2021/7/23"],
        ["https://pic3.zhimg.com/80/v2-d9766956d5c85c2780e4c5008fd946ca_1440w.jpg", "https://github.com/happysnaker/StudentsManageSystem", "学生管理系统", "C语言+AVL树+多重双向表实现"]
    ],


    /**
     * 这里填写您的工作经历
     * ["日期"， "工作"， "介绍"]
     * 你可以内嵌HTML标签以排版格式
     */
    work: [
        //如果您内有工作经历，您可以采取下列写法
        // ["————————", "", "<p>暂无工作经历，期待您的联系。</p>"]

        ["2023/07/01 — 至今", "<br>知乎 北京",
            "<p><strong>基础架构部 -- golang 后端开发</strong></p>" +
            "<p>1. 负责知乎数据库运维平台的开发和维护，确保平台的稳定运行。 </p>" +
            "<p>2. 参与平台的日常开发工作，包括代码编写，功能实现和性能优化。</p>" +
            "<p>3. 负责处理平台的故障和问题，提供即时有效的解决方案。</p>" +
            "<p>4. 参与 oncall  承接，即时响应并解决各种技术问题。</p>"
        ],

        ["2023/02/01 — 2023/06/01", "<br>七牛云 上海",
            "<p><strong>基础业务部 -- golang 开发实习生</strong></p>" +
            "<p>参与 RIO 专有云平台的设计、开发和优化，实现虚拟机的模板和部署，以及定制化需求开发。</p>"
        ],

        ["2022/08/26 — 2022/12/26", "<br>哔哩哔哩 上海",
            "<p><strong>工程效率部 -- golang 开发实习生</strong></p>" +
            "<p>负责 marthe 平台开发与维护，实现业务数据的可视化计算、展示、分析、存储。</p>"
        ]
    ],


    /**
     * 这里填写你的其他经历
     * ["日期"， "经历"， "介绍"]
     * 建议填写您的校级及以上得奖经历或或其他证书
     */
    others: [
        ["2022-11", "七牛云校园黑客马拉松 三等奖", "团体赛, 和来自全国上百所高校的技术达人同场竞技，在这里找到志同道合的伙伴。从校园到职场，从功课到工程，提前感受一线开发气氛，还没毕业就有工作经验。"],
        ["2022-07", "达内项目峰会 全国优胜金奖(adastra 视频网站)", "负责整个项目的需求分析，根据需求分析分配和细化小组成员的工作、系统数据库设计、接口设计和开发、核心模块设计和开发、前后端关键代码开发、整合测试小组成员开发的功能、为其他成员解答疑惑以及项目的部署和维护。"],
        ["2022-06", "第十三届蓝桥杯大学生程序设计大赛 全国二等奖", "个人赛,零基础自学 Python 参赛,取得全国二等奖。蓝桥杯全国软件和信息技术专业人才大赛(简称“蓝桥杯大赛”)由工业和信息化部人才交流中心主办，国信蓝桥教育科技有限公司承办。"],
        ["2022-05", "第十三届蓝桥杯大学生程序设计大赛 省一等奖", "个人赛,零基础自学 Python 参赛,取得省一等奖。蓝桥杯全国软件和信息技术专业人才大赛(简称“蓝桥杯大赛”)由工业和信息化部人才交流中心主办，国信蓝桥教育科技有限公司承办。"],
        ["2022-03", "第一届 ACC 全国高校联赛决赛 148/854", "ACC(AcWing Cup)高校联赛是由AcWing举办的算法比赛，难度与蓝桥杯省赛持平，ACM赛制。"],
    ],


    /**
     * 在这里填写您的社交网络平台
     * ["img", "url", "desc"]
     * img是社交平台的图标，在./svg目录下我们已经准备好了 微博、简书、掘金、小红书、知乎、csdn、facebook、github、力扣、CF和qq的图标
     * url是您链接
     * desc是一段描述，将鼠标移入将会显示该描述
     * 建议您放置数量 <= 5
     */
    icon: [
        ["./svg/github.svg", "https://github.com/arturiamu", "我的GitHub主页"],
        ["./svg/博客.svg", "https://blog.mulinbiao.com", "我的个人博客"],
        ["./svg/csdn.svg", "https://blog.csdn.net/qq_43353586", "我的CSDN主页"],
    ],


    //这是一些图片链接，建议您仅更改第二个头像图片
    url: [
        //背景图、头像、作品展示背景、其他经历背景
        "./images/intro-bg.jpg",
        "./images/avatar1.jpg",
        "./images/work-bk.png",
        "./images/4.jpg"
    ]

}