const config = {
    /*在这里配置你的基本信息，所有数据以字符串形式给出*/
    name: "木林彪",
    sex: "男",
    age: "24",
    phone: "15911245016",
    email: "arturiamumu@gmail.com",
    address: "现居北京",
    qq: "1743089727",
    log: "arturiamu",
    excpect_work: "Golang 后端开发",


    /*在这里配置首页的座右铭集合*/
    motto: [
        "如果还没想清楚，就用蛮力算法。——Ken Thompson",
        "不要使用反正弦和反余弦函数——你总能用优美的恒等式，或者是计算向量点积来更好地解决问题。—— Jim Conyngham",
        "在存储日期中的年份的时候，请使用四位数字。—— David Martin",
        "避免使用不对称结构。—— Andy Huber",
        "代码写的越急，程序跑得越慢。—— Roy Carlson",
        "你用英语都写不出来的东西就别指望用代码写了。—— Peter Halpern",
        "如果代码和注释不一致，那很可能两者都错了。—— Norm Schryer",
        "如果你发现特殊情况太多，那你肯定是用错方法了。—— Carig Zerouni",
        "先把数据结构搞清楚，程序的其余部分自现。—— David Jones",
    ],


    /*在这里配置首页的见面信息，你可以内嵌HTML标签以调整格式*/
    welcome: "你好，我叫木林彪，是一名后端程序员<br>" +
        "作为 Apple、Microsoft、Google、Intel、NVIDIA、Qualcomm、中国电信、中国移动、阿里巴巴集团、百度、腾讯、京东、哔哩哔哩、中国银行、中国证监局、国家电网、中国铁路局等数十家国内外企业的投资人之一，并且保持着长期稳定的贸易与投资关系，每年助力企业产生数百亿的交易额的同时，为人低调。<br>" +
        "很高兴见到你!",


    /*在这里配置关于我的信息，你可以内嵌HTML标签以调整格式*/
    skills_description: "<ul>" +
        "     <li>熟悉 go 语言： 对 GPM 等有一定的理解，熟悉 gin、gorm 框架等，能够快速开发。             </li>" +
        "     <li>熟悉云原生： 了解 k8s 各个组件，docker  等使用。</li>" +
        "     <li>熟悉 MySQL： innodb  存储引擎、事务、MVCC、B+树。</li>" +
        "     <li>熟悉 Redis： 主从复制、持久化的实现、AOF 重写、数据淘汰策略、一致性哈希等。</li>" +
        "     <li>熟悉计算机网络： 了解各层的划分、tcp 的连接管理、动态路由寻址、HTTP 请求、DNS 域名解析等。</li>" +
        "     <li>熟悉操作系统知识： 进程的同步、进程间的通信、设备的管理、内存的分配等。</li>" +
        " </ul>",

    about: "<p>我叫木林彪，毕业于昆明理工大学(2023)。</p>" +
        "<p>我是一名专注于 Golang 后端开发的程序员，目前就职于北京知乎，基础架构部。在这里，我负责数据库运维平台的开发和维护，确保平台的稳定运行。我的工作涵盖了日常开发工作、故障处理以及参与 oncall 承接，即时响应并解决各种技术问题。</p>" +
        "<p>我熟练掌握 Golang 语言及其生态系统，具备扎实的编程基础和丰富的项目经验。我注重代码质量和可维护性，善于解决各种技术问题，并且乐于接受新技术的挑战。</p>" +
        "<p>十分期待与您的联系!</p>",

    /*这里填写你的技能描述，你可以内嵌HTML标签以调整格式*/
    /**
     * 在这里配置你的技能点
     * ["技能点", 掌握程度, "技能条颜色"]
     */
    skills: [
        ["GoLang", 90, "#ff001d"],
        ["数据库", 88, "#ff424b"],
        ["操作系统", 85, "#ff992e"],
        ["计算机网络", 85, "#ecc24a"],
        ["前端技能", 83, "#fefd41"],
    ],


    /**
     * 这里填写你的个人作品展示
     * ["img"，"url", "ProjectName", "brief"]
     * img表示您的作品图片链接，url表示您的项目地址，ProjectName表示您的仓库或作品名称，brief是一句简短的介绍
     * 通过查看实际效果以调整字题长度
     */
    portfolio: [
        ["./images/pro-1.png", "https://blog.mulinbiao.com", "个人博客", "这里记录了我的工作,学习和生活<br>持续更新"],
    ],


    /**
     * 这里填写您的工作经历
     * ["日期"， "工作"， "介绍"]
     * 你可以内嵌HTML标签以排版格式
     */
    work: [
        //如果您内有工作经历，您可以采取下列写法
        // ["————————", "", "<p>暂无工作经历，期待您的联系。</p>"]

        ["2023/07/01 — 至今", "<br>知乎 北京",
            "<p><strong>基础架构部 -- golang 后端开发</strong></p>" +
            "<p>1. 负责知乎数据库运维平台的开发和维护，确保平台的稳定运行。 </p>" +
            "<p>2. 参与平台的日常开发工作，包括代码编写，功能实现和性能优化。</p>" +
            "<p>3. 负责处理平台的故障和问题，提供即时有效的解决方案。</p>" +
            "<p>4. 参与 oncall  承接，即时响应并解决各种技术问题。</p>"
        ],

        ["2023/02/01 — 2023/06/01", "<br>七牛云 上海",
            "<p><strong>基础业务部 -- golang 开发实习生</strong></p>" +
            "<p>参与 RIO 专有云平台的设计、开发和优化，实现虚拟机的模板和部署，以及定制化需求开发。</p>"
        ],

        ["2022/08/26 — 2022/12/26", "<br>哔哩哔哩 上海",
            "<p><strong>工程效率部 -- golang 开发实习生</strong></p>" +
            "<p>参与云效平台（Marthe） 的开发和维护，实现数据汇总和分析，为 PMO  报表大盘提供数据支撑。</p>"
        ]
    ],


    /**
     * 这里填写你的其他经历
     * ["日期"， "经历"， "介绍"]
     * 建议填写您的校级及以上得奖经历或或其他证书
     */
    others: [
        ["2022-11", "七牛云校园黑客马拉松 三等奖", "团体赛, 和来自全国上百所高校的技术达人同场竞技，在这里找到志同道合的伙伴。从校园到职场，从功课到工程，提前感受一线开发气氛，还没毕业就有工作经验。"],
        ["2022-07", "达内项目峰会 全国优胜金奖(adastra 视频网站)", "负责整个项目的需求分析，根据需求分析分配和细化小组成员的工作、系统数据库设计、接口设计和开发、核心模块设计和开发、前后端关键代码开发、整合测试小组成员开发的功能、为其他成员解答疑惑以及项目的部署和维护。"],
        ["2022-06", "第十三届蓝桥杯大学生程序设计大赛 全国二等奖", "个人赛,零基础自学 Python 参赛,取得全国二等奖。蓝桥杯全国软件和信息技术专业人才大赛(简称“蓝桥杯大赛”)由工业和信息化部人才交流中心主办，国信蓝桥教育科技有限公司承办。"],
        ["2022-05", "第十三届蓝桥杯大学生程序设计大赛 省一等奖", "个人赛,零基础自学 Python 参赛,取得省一等奖。蓝桥杯全国软件和信息技术专业人才大赛(简称“蓝桥杯大赛”)由工业和信息化部人才交流中心主办，国信蓝桥教育科技有限公司承办。"],
        ["2022-03", "第一届 ACC 全国高校联赛决赛 148/854", "ACC(AcWing Cup)高校联赛是由AcWing举办的算法比赛，难度与蓝桥杯省赛持平，ACM赛制。"],
    ],


    /**
     * 在这里填写您的社交网络平台
     * ["img", "url", "desc"]
     * img是社交平台的图标，在./svg目录下我们已经准备好了 微博、简书、掘金、小红书、知乎、csdn、facebook、github、力扣、CF和qq的图标
     * url是您链接
     * desc是一段描述，将鼠标移入将会显示该描述
     * 建议您放置数量 <= 5
     */
    icon: [
        ["./svg/github.svg", "https://github.com/arturiamu", "我的GitHub主页"],
        ["./svg/博客.svg", "https://blog.mulinbiao.com", "我的个人博客"],
        ["./svg/csdn.svg", "https://blog.csdn.net/qq_43353586", "我的CSDN主页"],
    ],


    //这是一些图片链接，建议您仅更改第二个头像图片
    url: [
        //背景图、头像、作品展示背景、其他经历背景
        "./images/intro-bg.jpg",
        "./images/avatar1.jpg",
        "./images/work-bk.png",
        "./images/4.jpg"
    ]

};